Examinator/src/Documents/ПопыткаВыполненияАктивногоРесурсаSCORM/ПопыткаВыполненияАктивногоРесурсаSCORM.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПопыткаВыполненияАктивногоРесурсаSCORM</name>
  <registerRecords>InformationRegister.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ</registerRecords>
  <attributes>
    <name>Ресурс</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СводЗнаний</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DefinedType.ПрохождениеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлементСодержанияСводаЗнаний</name>
    <type>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПопыткаЗавершена</name>
    <comment>exit &lt;> suspend</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВыхода</name>
    <comment>exit</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеВыполнения</name>
    <comment>completion_status</comment>
    <type>
      <types>EnumRef.СостоянияВыполненияОбъектовSCORM</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентВыполнения</name>
    <comment>progress_measure</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>7</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущееПоложение</name>
    <comment>Location</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеПопытки</name>
    <comment>suspend_data</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьПоследнейСессии</name>
    <comment>session_time</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяПродолжительностьСессий</name>
    <comment>total_time</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеПрохождения</name>
    <comment>success_status</comment>
    <type>
      <types>EnumRef.СостоянияПрохожденияОбъектовSCORM</types>
    </type>
  </attributes>
  <attributes>
    <name>Результат</name>
    <comment>score.raw</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>7</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РезультатВПроцентах</name>
    <comment>score.scaled</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>7</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноВозможныйРезультат</name>
    <comment>score.max</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>7</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноВозможныйРезультат</name>
    <comment>score.min</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>7</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КомментарииПользователей</name>
    <comment>comments_from_learner</comment>
    <attributes>
      <name>Номер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Текст</name>
      <comment>Comment</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущееПоложение</name>
      <comment>Location</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Интерактивности</name>
    <comment>interactions</comment>
    <attributes>
      <name>Номер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <comment>id</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <comment>type</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения</name>
      <comment>timestamp</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесОценки</name>
      <comment>weighting</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>7</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтветПользователя</name>
      <comment>learner_response</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <comment>result</comment>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>7</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <comment>latency</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <comment>description</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Цели</name>
      <comment>objectives (тип: Массив, Индекс: Номер, Значение: id)</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ВерныеОтветы</name>
      <comment>correct_responses (тип: Массив, Ключ: Индекс, Значение: pattern)</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Цели</name>
    <comment>objectives</comment>
    <attributes>
      <name>Номер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <comment>id</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <comment>score.raw</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>7</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатВПроцентах</name>
      <comment>score.scaled</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>7</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальноВозможныйРезультат</name>
      <comment>score.max</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>7</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МинимальноВозможныйРезультат</name>
      <comment>score.min</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>7</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеПрохождения</name>
      <comment>success_status</comment>
      <type>
        <types>EnumRef.СостоянияПрохожденияОбъектовSCORM</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеВыполнения</name>
      <comment>completion_status</comment>
      <type>
        <types>EnumRef.СостоянияВыполненияОбъектовSCORM</types>
      </type>
    </attributes>
    <attributes>
      <name>Прогресс</name>
      <comment>progress_measure</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>7</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <comment>description</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сессии</name>
    <attributes>
      <name>ДатаИнициализации</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗакрытия</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтатистикаПараметров</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>EnumRef.ИспользуемыеПараметрыSCORM</types>
      </type>
    </attributes>
    <attributes>
      <name>Передан</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПереданСОшибкой</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/CommonModules/ОбъектыSCORM/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции специфичные для ресурсов SCORM

////////////////////////////////////////////////////////////////////////////////
// Общие

// Выполняет поиск попытки прохождения объекта SCORM.
//
Функция ПолучитьНезавершеннуюПопыткуВыполненияОбъектаSCORM(Пользователь, ЭлектронныйРесурс, ЭлементСодержания, Ресурс, ПрохождениеОбучения, Задание) Экспорт
	   
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПопыткаВыполненияАктивногоРесурсаSCORM.Ссылка
		|ИЗ
		|	Документ.ПопыткаВыполненияАктивногоРесурсаSCORM КАК ПопыткаВыполненияАктивногоРесурсаSCORM
		|ГДЕ
		|	ПопыткаВыполненияАктивногоРесурсаSCORM.Проведен = ИСТИНА
		|	И ПопыткаВыполненияАктивногоРесурсаSCORM.Ресурс = &Ресурс
		|	И ПопыткаВыполненияАктивногоРесурсаSCORM.Пользователь = &Пользователь
		|	И ПопыткаВыполненияАктивногоРесурсаSCORM.СводЗнаний = &ЭлектронныйРесурс
		|	И ПопыткаВыполненияАктивногоРесурсаSCORM.ПрохождениеОбучения = &ПрохождениеОбучения
		|	И ПопыткаВыполненияАктивногоРесурсаSCORM.Задание = &Задание
		|	И ПопыткаВыполненияАктивногоРесурсаSCORM.ЭлементСодержанияСводаЗнаний = &ЭлементСодержания
		|	И ПопыткаВыполненияАктивногоРесурсаSCORM.Отменено = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПопыткаВыполненияАктивногоРесурсаSCORM.Дата УБЫВ";

	Запрос.УстановитьПараметр("Задание", Задание);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ПрохождениеОбучения", ПрохождениеОбучения);
	Запрос.УстановитьПараметр("Ресурс", Ресурс);
	Запрос.УстановитьПараметр("ЭлектронныйРесурс", ЭлектронныйРесурс);
	Запрос.УстановитьПараметр("ЭлементСодержания", ЭлементСодержания);

	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	ВыборкаДетальныеЗаписи.Следующий();

	Возврат ВыборкаДетальныеЗаписи.Ссылка;
	
КонецФункции

// Получает объект XDTO попытки выполнения SCORM-объекта
//
Функция ПолучитьМодельДанныхПопыткиОбъектаSCORM(ДокументПопыткиОбъект, КонтекстВыполнения, НоваяПопытка=Ложь) Экспорт
	
	cmiXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/SCORM/DataModel", "cmi"); 
	cmiXDTO     = ФабрикаXDTO.Создать(cmiXDTOТип);
	
	// _version
	
	cmiXDTO._version = "1.0";
	
	// comments_from_learner
	
	comments_from_learnerXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/SCORM/DataModel", "comments_from_learner");
	
	ДокументПопыткиОбъект.КомментарииПользователей.Сортировать("Номер Возр");
	
	Для каждого Строка Из ДокументПопыткиОбъект.КомментарииПользователей Цикл
	
		comments_from_learnerXDTO  = ФабрикаXDTO.Создать(comments_from_learnerXDTOТип);
		comments_from_learnerXDTO.comment = Строка.Текст;
		comments_from_learnerXDTO.location = Строка.ТекущееПоложение;
		comments_from_learnerXDTO.timestamp = Строка.ДатаИзменения;
		comments_from_learnerXDTO._children = "comment,location,timestamp";
		
		cmiXDTO.comments_from_learner.Добавить(comments_from_learnerXDTO);
		
	КонецЦикла;
	
	// interactions
	
	interactionsXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/SCORM/DataModel", "interactions");
	
	ДокументПопыткиОбъект.Интерактивности.Сортировать("Номер Возр");
	
	Для каждого Строка Из ДокументПопыткиОбъект.Интерактивности Цикл
		
		interactionsXDTO  = ФабрикаXDTO.Создать(interactionsXDTOТип);
		
		interactionsXDTO._children = "id,type,objectives,timestamp,correct_responses,weighting,learner_response,result,latency,description";
		
		interactionsXDTO.id = Строка.Идентификатор;
				
		interactionsXDTO.type = Строка.Тип;
		
		objectivesXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/SCORM/DataModel", "objectives");
		МассивЦелей = Строка.Цели.Получить();
		Если ТипЗнч(МассивЦелей) = Тип("Массив") Тогда
			Для каждого Цель Из МассивЦелей Цикл
				Если Цель = Неопределено Тогда
					Цель = "";
				КонецЕсли;
				objectiveXDTO = ФабрикаXDTO.Создать(objectivesXDTOТип);
				objectiveXDTO.id = Цель;
				interactionsXDTO.objectives.Добавить(objectiveXDTO);
			КонецЦикла;
		КонецЕсли;
		
		interactionsXDTO.timestamp = Строка.ДатаИзменения;
		
		correct_responsesXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/SCORM/DataModel", "correct_responses");
		МассивВерныхОтветов = Строка.ВерныеОтветы.Получить();
		Если ТипЗнч(МассивВерныхОтветов) = Тип("Массив") Тогда
			Для каждого ВерныйОтвет Из МассивВерныхОтветов Цикл
				Если ВерныйОтвет = Неопределено Тогда
					ВерныйОтвет = "";
				КонецЕсли;
				correct_responseXDTO = ФабрикаXDTO.Создать(correct_responsesXDTOТип);
				correct_responseXDTO.pattern = ВерныйОтвет;
				interactionsXDTO.correct_responses.Добавить(correct_responseXDTO);
			КонецЦикла;
		КонецЕсли;
		
		interactionsXDTO.weighting = Формат(Строка.ВесОценки, "ЧРД=.; ЧРГ=0; ЧН=0; ЧО=1");
		
		interactionsXDTO.learner_response = Строка.ОтветПользователя;
		
		Если ТипЗнч(Строка.Результат) = Тип("Число") Тогда
			interactionsXDTO.result = Формат(Строка.Результат, "ЧРД=.; ЧРГ=0; ЧН=0; ЧО=1");
		Иначе
			Если ЗначениеЗаполнено(Строка.Результат) Тогда
				interactionsXDTO.result = Строка.Результат;
			Иначе
				interactionsXDTO.result = "";
			КонецЕсли;
		КонецЕсли;
		
		interactionsXDTO.latency = Строка.Продолжительность;
		
		interactionsXDTO.description = Строка.Описание;
		
		cmiXDTO.interactions.Добавить(interactionsXDTO);
		
	КонецЦикла;	
	
	// objectives
	
	objectivesXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/SCORM/DataModel", "objectives");
	scoreXDTOТип       = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/SCORM/DataModel", "score");
	
	ДокументПопыткиОбъект.Цели.Сортировать("Номер Возр");
	
	Для каждого Строка Из ДокументПопыткиОбъект.Цели Цикл
		
		objectivesXDTO  = ФабрикаXDTO.Создать(objectivesXDTOТип);
		
		objectivesXDTO._children = "id,score,success_status,completion_status,progress_measure,description";
		
		objectivesXDTO.id = Строка.Идентификатор;
		
		scoreXDTO  = ФабрикаXDTO.Создать(scoreXDTOТип);
		scoreXDTO.max = Формат(Строка.МаксимальноВозможныйРезультат, "ЧРД=.; ЧРГ=0; ЧН=0; ЧО=1");
		scoreXDTO.min = Формат(Строка.МинимальноВозможныйРезультат, "ЧРД=.; ЧРГ=0; ЧН=0; ЧО=1");
		scoreXDTO.raw = Формат(Строка.Результат, "ЧРД=.; ЧРГ=0; ЧН=0; ЧО=1");
		scoreXDTO.scaled = Формат(Строка.РезультатВПроцентах, "ЧРД=.; ЧРГ=0; ЧН=0; ЧО=1");
		scoreXDTO._children = "scaled,min,max,raw";
		objectivesXDTO.score = scoreXDTO;
		
		objectivesXDTO.success_status = ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(Строка.СостояниеПрохождения);
		
		objectivesXDTO.completion_status = ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(Строка.СостояниеВыполнения);
		
		objectivesXDTO.progress_measure = Формат(Строка.Прогресс, "ЧРД=.; ЧРГ=0; ЧН=0; ЧО=1");
		
		objectivesXDTO.description = Строка.Описание;
		
		cmiXDTO.objectives.Добавить(objectivesXDTO);
		
	КонецЦикла;	
	
	// completion_status
	
	cmiXDTO.completion_status = ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(ДокументПопыткиОбъект.СостояниеВыполнения);
	
	// learner_id, learner_name
	
	cmiXDTO.learner_id   = Строка(ОбъектыСУЗ.ТекущийПользователь(КонтекстВыполнения).УникальныйИдентификатор());
	cmiXDTO.learner_name = ОбъектыСУЗ.ТекущийПользователь(КонтекстВыполнения).Наименование;
	
	// entry
	
	Если НоваяПопытка Тогда
		cmiXDTO.entry = "";		
	Иначе
		cmiXDTO.entry = "resume";
	КонецЕсли;

	// location
	
	cmiXDTO.location = ДокументПопыткиОбъект.ТекущееПоложение;
	
	// suspend_data
	
	cmiXDTO.suspend_data = ДокументПопыткиОбъект.ДанныеПопытки;
		
	// score
	
	scoreXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/SCORM/DataModel", "score");
	scoreXDTO  = ФабрикаXDTO.Создать(scoreXDTOТип);
	
	scoreXDTO.max = Формат(ДокументПопыткиОбъект.МаксимальноВозможныйРезультат, "ЧРД=.; ЧРГ=0; ЧН=0; ЧО=1");
	scoreXDTO.min = Формат(ДокументПопыткиОбъект.МинимальноВозможныйРезультат, "ЧРД=.; ЧРГ=0; ЧН=0; ЧО=1");
	scoreXDTO.raw = Формат(ДокументПопыткиОбъект.Результат, "ЧРД=.; ЧРГ=0; ЧН=0; ЧО=1");
	scoreXDTO.scaled = Формат(ДокументПопыткиОбъект.РезультатВПроцентах, "ЧРД=.; ЧРГ=0; ЧН=0; ЧО=1");
	scoreXDTO._children = "scaled,min,max,raw";
	
	cmiXDTO.score = scoreXDTO;
	
	// session_time
	
	cmiXDTO.session_time = ДокументПопыткиОбъект.ПродолжительностьПоследнейСессии;
	
	// success_status
	
	cmiXDTO.success_status = ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(ДокументПопыткиОбъект.СостояниеПрохождения);
	
	// total_time
	
	cmiXDTO.total_time = ДокументПопыткиОбъект.ОбщаяПродолжительностьСессий;
	
	// exit
	
	cmiXDTO.exit = ДокументПопыткиОбъект.ПричинаВыхода;
	
	// launch_data
	
	ЭлементСодержанияСводаЗнаний = ДокументПопыткиОбъект.ЭлементСодержанияСводаЗнаний;	
	
	cmiXDTO.launch_data = ЭлементСодержанияСводаЗнаний.ДанныеИнициализации;
	
	// time_limit_action
	
	cmiXDTO.time_limit_action = Перечисления.ДействияПослеИстеченияВремениВыполненияОбъектаSCORM.ЗначениеSCORM(ЭлементСодержанияСводаЗнаний.ДействиеПослеИстеченияВремени);
	
	// max_time_allowed
	
	Если ЗначениеЗаполнено(ЭлементСодержанияСводаЗнаний.ПродолжительностьПопытки) Тогда
		cmiXDTO.max_time_allowed = ЭлементСодержанияСводаЗнаний.ПродолжительностьПопытки; 	
	Иначе
		cmiXDTO.max_time_allowed = "";
	КонецЕсли;
	
	// completion_threshold
	
	Если ЗначениеЗаполнено(ЭлементСодержанияСводаЗнаний.ПорогВыполнения) Тогда
		cmiXDTO.completion_threshold = Формат(ЭлементСодержанияСводаЗнаний.ПорогВыполнения, "ЧРД=.; ЧРГ=0; ЧН=0; ЧО=1");
	Иначе
		cmiXDTO.completion_threshold = "";
	КонецЕсли;
	
	// progress_measure
	
	Если ЗначениеЗаполнено(ДокументПопыткиОбъект.ПроцентВыполнения) Тогда
		cmiXDTO.progress_measure = Формат(ДокументПопыткиОбъект.ПроцентВыполнения, "ЧРД=.; ЧРГ=0; ЧН=0; ЧО=1");
	Иначе
		cmiXDTO.progress_measure = "";
	КонецЕсли;
	
	// scaled_passing_score
	
	cmiXDTO.scaled_passing_score = "1.0"; // (default value) !!!
	
	// credit
	
	cmiXDTO.credit = "credit";	
	
	// mode
	
	cmiXDTO.mode = "normal";	
	
	Возврат cmiXDTO;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Работа с временными интервалами

// Получает структуру временного интервала в формате SCORM
//
Функция ПолучитьСтруктуруВременногоИнтервалаSCORM(Знач ВременнойИнтервал) Экспорт
	
	Позиция1  = Найти(ВременнойИнтервал, "P");
	Позиция5  = Найти(ВременнойИнтервал, "T");
	
	Если Позиция1 = 1 Тогда
		
		Если Позиция5 > 0 Тогда
			ПерваяЧасть = Сред(ВременнойИнтервал, Позиция1, Позиция5-1);
		Иначе
			ПерваяЧасть = ВременнойИнтервал;
		КонецЕсли;
		
		Позиция2 = Найти(ПерваяЧасть, "Y");
		Если Позиция2 > 0 Тогда
			КоличествоЛет = Число(Сред(ПерваяЧасть, Позиция1+1, Позиция2-Позиция1-1));
		Иначе
			Позиция2 = Позиция1;
			КоличествоЛет = 0;
		КонецЕсли;
		
		Позиция3 = Найти(ПерваяЧасть, "M");
		Если Позиция3 > 0 Тогда
			КоличествоМесяцев = Число(Сред(ПерваяЧасть, Позиция2+1, Позиция3-Позиция2-1));
		Иначе
			Позиция3 = Позиция2;
			КоличествоМесяцев = 0;
		КонецЕсли;
		
		Позиция4 = Найти(ПерваяЧасть, "D");
		Если Позиция4 > 0 Тогда
			КоличествоДней = Число(Сред(ПерваяЧасть, Позиция3+1, Позиция4-Позиция3-1));
		Иначе
			Позиция4 = Позиция3;
			КоличествоДней = 0;
		КонецЕсли;
		
	Иначе
		Возврат 0;
	КонецЕсли;
	
	Если Позиция5 > 0 Тогда
		
		ВтораяЧасть = Сред(ВременнойИнтервал, Позиция5+1, СтрДлина(ВременнойИнтервал)-Позиция5);
		Позиция1 = 0;
		
		Позиция2 = Найти(ВтораяЧасть, "H");
		Если Позиция2 > 0 Тогда
			КоличествоЧасов = Число(Сред(ВтораяЧасть, Позиция1+1, Позиция2-Позиция1-1));
		Иначе
			Позиция2 = Позиция1;
			КоличествоЧасов = 0;
		КонецЕсли;
		
		Позиция3 = Найти(ВтораяЧасть, "M");
		Если Позиция3 > 0 Тогда
			КоличествоМинут = Число(Сред(ВтораяЧасть, Позиция2+1, Позиция3-Позиция2-1));
		Иначе
			Позиция3 = Позиция2;
			КоличествоМинут = 0;
		КонецЕсли;
		
		Позиция4 = Найти(ВтораяЧасть, "S");
		Если Позиция4 > 0 Тогда
			КоличествоСекунд = Сред(ВтораяЧасть, Позиция3+1, Позиция4-Позиция3-1);
			КоличествоСекунд = СтрЗаменить(КоличествоСекунд, ".", ",");
			КоличествоСекунд = Окр(Число(КоличествоСекунд));
		Иначе
			Позиция4 = Позиция3;
			КоличествоСекунд = 0;
		КонецЕсли;
		
	Иначе
		КоличествоЧасов  = 0;
		КоличествоМинут  = 0;
		КоличествоСекунд = 0;
	КонецЕсли;
	
	СтруктураИнтервала = Новый Структура();
	СтруктураИнтервала.Вставить("КоличествоЛет", КоличествоЛет);
	СтруктураИнтервала.Вставить("КоличествоМесяцев", КоличествоМесяцев);
	СтруктураИнтервала.Вставить("КоличествоДней", КоличествоДней);
	СтруктураИнтервала.Вставить("КоличествоЧасов", КоличествоЧасов);
	СтруктураИнтервала.Вставить("КоличествоМинут", КоличествоМинут);
	СтруктураИнтервала.Вставить("КоличествоСекунд", КоличествоСекунд);
	
	Возврат СтруктураИнтервала;
	
КонецФункции

// Получает количество секунд из структуры временного интервала
//
Функция ПолучитьКоличествоСекундВременногоИнтервалаSCORM(Знач ВременнойИнтервал) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ВременнойИнтервал) Тогда
		Возврат 0;
	КонецЕсли;
	
	СтруктураИнтервала = ПолучитьСтруктуруВременногоИнтервалаSCORM(ВременнойИнтервал);
	
	СуммаСекунд = ПолучитьКоличествоСекундИзСтруктурыВременногоИнтервала(СтруктураИнтервала);
	
	Возврат СуммаСекунд;
	
КонецФункции

// Получает сумму двух временных интервалов
//
Функция СуммироватьДваВременногоИнтервала(Знач ВременнойИнтервал1, Знач ВременнойИнтервал2) Экспорт
	
	СуммаСекунд1 = ПолучитьКоличествоСекундВременногоИнтервалаSCORM(ВременнойИнтервал1);
	СуммаСекунд2 = ПолучитьКоличествоСекундВременногоИнтервалаSCORM(ВременнойИнтервал2);
	
	ОбщаяСуммаСекунд = СуммаСекунд1 + СуммаСекунд2;
	
	Возврат ПолучитьИзКоличестваСекундВременнойИнтервалSCORM(ОбщаяСуммаСекунд);
	
КонецФункции

// Получает из количества секунд временной интервал SCORM
//
Функция ПолучитьИзКоличестваСекундВременнойИнтервалSCORM(Знач СуммаСекунд) Экспорт
	
	КоличествоЛет = Цел(СуммаСекунд/31536000);
	
	Если КоличествоЛет > 0 Тогда
		СуммаСекунд = СуммаСекунд - 31536000*КоличествоЛет;
	КонецЕсли;
	
	КоличествоМесяцев = Цел(СуммаСекунд/2628000); 
	
	Если КоличествоМесяцев > 0 Тогда
		СуммаСекунд = СуммаСекунд - 2628000*КоличествоМесяцев;
	КонецЕсли;
	
	КоличествоДней = Цел(СуммаСекунд/86400); 
	
	Если КоличествоДней > 0 Тогда
		СуммаСекунд = СуммаСекунд - 86400*КоличествоДней;
	КонецЕсли;
	
	КоличествоЧасов = Цел(СуммаСекунд/3600); 
	
	Если КоличествоЧасов > 0 Тогда
		СуммаСекунд = СуммаСекунд - 3600*КоличествоЧасов;
	КонецЕсли;
	
	КоличествоМинут = Цел(СуммаСекунд/60); 
	
	Если КоличествоМинут > 0 Тогда
		СуммаСекунд = СуммаСекунд - 60*КоличествоМинут;
	КонецЕсли;
	
	СтрокаИнтервала = "P";
	
	Если КоличествоЛет > 0 Тогда
		СтрокаИнтервала = СтрокаИнтервала + Строка(КоличествоЛет) + "Y";
	КонецЕсли;
	
	Если КоличествоМесяцев > 0 Тогда
		СтрокаИнтервала = СтрокаИнтервала + Строка(КоличествоМесяцев) + "M";
	КонецЕсли;
	
	Если КоличествоДней > 0 Тогда
		СтрокаИнтервала = СтрокаИнтервала + Строка(КоличествоДней) + "D";
	КонецЕсли;
	
	Если КоличествоЧасов > 0 ИЛИ КоличествоМинут > 0 ИЛИ СуммаСекунд > 0 Тогда
		
		СтрокаИнтервала = СтрокаИнтервала + "T";
		
		Если КоличествоЧасов > 0 Тогда
			СтрокаИнтервала = СтрокаИнтервала + Строка(КоличествоЧасов) + "H";
		КонецЕсли;
		
		Если КоличествоМинут > 0 Тогда
			СтрокаИнтервала = СтрокаИнтервала + Строка(КоличествоМинут) + "M";
		КонецЕсли;
		
		Если СуммаСекунд > 0 Тогда
			СтрокаИнтервала = СтрокаИнтервала + Строка(СуммаСекунд) + "S";
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтрокаИнтервала;
	
КонецФункции

// Получает время в формате даты из временного интервала.
// Внимание: в отличие от интервала, время не может превышать 23.59.59
Функция ПолучитьДатуИзВременногоИнтервала(Знач ВременнойИнтервал) Экспорт
	
	СуммаСекунд = ПолучитьКоличествоСекундВременногоИнтервалаSCORM(ВременнойИнтервал);
	
	КоличествоЧасов = Цел(СуммаСекунд/3600); 
	
	Если КоличествоЧасов > 0 Тогда
		СуммаСекунд = СуммаСекунд - 3600*КоличествоЧасов;
	КонецЕсли;
	
	Если КоличествоЧасов > 23 Тогда
		КоличествоЧасов = 23;
		КоличествоМинут = 59;
		КоличествоСекунд = 59;
	Иначе
		
		КоличествоМинут = Цел(СуммаСекунд/60); 
		
		Если КоличествоМинут > 0 Тогда
			КоличествоСекунд = СуммаСекунд - 60*КоличествоМинут;
		Иначе
			КоличествоСекунд = СуммаСекунд;
		КонецЕсли;
		
	КонецЕсли;
	
	Если КоличествоЧасов < 10 Тогда
		КоличествоЧасов = Строка("0") + Строка(КоличествоЧасов);
	КонецЕсли;
	
	Если КоличествоМинут < 10 Тогда
		КоличествоМинут = Строка("0") + Строка(КоличествоМинут);
	КонецЕсли;
	
	Если КоличествоСекунд < 10 Тогда
		КоличествоСекунд = Строка("0") + Строка(КоличествоСекунд);
	КонецЕсли;
	
	Время = Дата("00010101"+Строка(КоличествоЧасов)+Строка(КоличествоМинут)+Строка(КоличествоСекунд));
	
	Возврат Время;
	
КонецФункции

// Получает время в формате даты из количества секунд.
// Внимание: в отличие от интервала, время не может превышать 23.59.59
Функция ПолучитьДатуИзКоличестваСекунд(Знач СуммаСекунд) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СуммаСекунд) Тогда
		Возврат Дата("00010101");
	КонецЕсли;
	
	ВременнойИнтервал = ПолучитьИзКоличестваСекундВременнойИнтервалSCORM(СуммаСекунд);
	
	Возврат ПолучитьДатуИзВременногоИнтервала(ВременнойИнтервал);	
	
КонецФункции

// Получает количество секунд на основании даты
//
Функция ПолучитьКоличествоСекундИзДаты(Знач Дата) Экспорт

	КоличествоЧасов  = Час(Дата);
	КоличествоМинут  = Минута(Дата);
	КоличествоСекунд = Секунда(Дата);
	
	Возврат (КоличествоЧасов*60*60) + (КоличествоМинут*60) + КоличествоСекунд;
	
КонецФункции

// Получает строковое представление из суммы секунд
//
Функция ПолучитьСтрокуИзКоличестваСекунд(Знач СуммаСекунд) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СуммаСекунд) Тогда
		Возврат "";
	КонецЕсли;

	КоличествоЧасов = Цел(СуммаСекунд/3600); 
	
	Если КоличествоЧасов > 0 Тогда
		СуммаСекунд = СуммаСекунд - 3600*КоличествоЧасов;
	КонецЕсли;
		
	КоличествоМинут = Цел(СуммаСекунд/60); 
	
	Если КоличествоМинут > 0 Тогда
		КоличествоСекунд = СуммаСекунд - 60*КоличествоМинут;
	Иначе
		КоличествоСекунд = СуммаСекунд;
	КонецЕсли;
	
	КоличествоСекунд = Окр(КоличествоСекунд);
	
	Если КоличествоЧасов < 10 Тогда
		КоличествоЧасов = Строка("0") + Строка(КоличествоЧасов);
	КонецЕсли;
	
	Если КоличествоМинут < 10 Тогда
		КоличествоМинут = Строка("0") + Строка(КоличествоМинут);
	КонецЕсли;
	
	Если КоличествоСекунд < 10 Тогда
		КоличествоСекунд = Строка("0") + Строка(КоличествоСекунд);
	КонецЕсли;
	
	
	
	Время = Строка(КоличествоЧасов) + ":" + Строка(КоличествоМинут) + ":" + Строка(КоличествоСекунд);
	
	Возврат Время;
	
КонецФункции

// Получает полное строковое представление из суммы секунд
//
Функция ПолучитьПолнуюСтрокуИзКоличестваСекунд(Знач СуммаСекунд, ГраницаИнтервала = Неопределено, Округлить = Ложь) Экспорт
	
	Если Округлить Тогда
		
		СекундВМинуте = 60;
		СекундВЧасе = СекундВМинуте * 60;
		СекундВСутках = СекундВЧасе * 24;
		
		Если СуммаСекунд / СекундВСутках > 1 Тогда
			СуммаСекунд = Окр(СуммаСекунд / СекундВСутках, 0, РежимОкругления.Окр15как10) * СекундВСутках;
		КонецЕсли;
		
		Если СуммаСекунд / СекундВМинуте > 1 Тогда
			СуммаСекунд = Окр(СуммаСекунд / СекундВМинуте, 0, РежимОкругления.Окр15как10) * СекундВМинуте;
		КонецЕсли;
			
	КонецЕсли;	
	
	ИнтервалSCORM = ПолучитьИзКоличестваСекундВременнойИнтервалSCORM(СуммаСекунд);
	
	СтруктураИнтервала = ПолучитьСтруктуруВременногоИнтервалаSCORM(ИнтервалSCORM);
	
	Если ГраницаИнтервала <> Неопределено Тогда
		
		Если ГраницаИнтервала > 0 Тогда
			СтруктураИнтервала.КоличествоМесяцев = СтруктураИнтервала.КоличествоМесяцев + (СтруктураИнтервала.КоличествоЛет * 12);
			СтруктураИнтервала.КоличествоЛет = 0;
		КонецЕсли;
		
		Если ГраницаИнтервала > 1 Тогда
			СтруктураИнтервала.КоличествоДней = СтруктураИнтервала.КоличествоДней + (СтруктураИнтервала.КоличествоМесяцев * 30);
			СтруктураИнтервала.КоличествоМесяцев = 0;
		КонецЕсли;
		
		Если ГраницаИнтервала > 2 Тогда
			СтруктураИнтервала.КоличествоЧасов = СтруктураИнтервала.КоличествоЧасов + (СтруктураИнтервала.КоличествоДней * 24);
			СтруктураИнтервала.КоличествоДней = 0;
		КонецЕсли;
		
		Если ГраницаИнтервала > 3 Тогда
			СтруктураИнтервала.КоличествоМинут = СтруктураИнтервала.КоличествоМинут + (СтруктураИнтервала.КоличествоЧасов * 60);
			СтруктураИнтервала.КоличествоЧасов = 0;
		КонецЕсли;
		
		Если ГраницаИнтервала > 4 Тогда
			СтруктураИнтервала.КоличествоСекунд = СтруктураИнтервала.КоличествоСекунд + (СтруктураИнтервала.КоличествоМинут * 60);
			СтруктураИнтервала.КоличествоМинут = 0;
		КонецЕсли;
		
	КонецЕсли;
	
	Строка     = "";
	ФормСтрока = "Л = ru_RU";
	
	Если СтруктураИнтервала.КоличествоЛет > 0 Тогда // 1
		ПарПредмета="год,года,лет,м,,,,,0";
		Строка = Строка + ЧислоПрописью(СтруктураИнтервала.КоличествоЛет, ФормСтрока, ПарПредмета) + ",";
	КонецЕсли;
	
	Если СтруктураИнтервала.КоличествоМесяцев > 0 Тогда // 2
		ПарПредмета="месяц,месяца,месяцев,м,,,,,0";
		Строка = Строка + ЧислоПрописью(СтруктураИнтервала.КоличествоМесяцев, ФормСтрока, ПарПредмета) + ",";
	КонецЕсли;
	
	Если СтруктураИнтервала.КоличествоДней > 0 Тогда //3
		ПарПредмета="день,дня,дней,м,,,,,0";
		Строка = Строка + ЧислоПрописью(СтруктураИнтервала.КоличествоДней, ФормСтрока, ПарПредмета) + ",";
	КонецЕсли;
	
	Если СтруктураИнтервала.КоличествоЧасов > 0 Тогда //4
		ПарПредмета="час,часа,часов,м,,,,,0";
		Строка = Строка + ЧислоПрописью(СтруктураИнтервала.КоличествоЧасов, ФормСтрока, ПарПредмета) + ",";
	КонецЕсли;
	
	Если СтруктураИнтервала.КоличествоМинут > 0 Тогда //5
		ПарПредмета="минута,минуты,минут,ж,,,,,0";
		Строка = Строка + ЧислоПрописью(СтруктураИнтервала.КоличествоМинут, ФормСтрока, ПарПредмета) + ",";
	КонецЕсли;
	
	Если СтруктураИнтервала.КоличествоСекунд > 0 Тогда //6
		ПарПредмета="секунда,секунды,секунд,ж,,,,,0";
		Строка = Строка + ЧислоПрописью(СтруктураИнтервала.КоличествоСекунд, ФормСтрока, ПарПредмета) + ",";
	КонецЕсли;
	
	Строка = НРег(Строка);
	
	Строка = Сред(Строка, 1, СтрДлина(Строка)-1);
	
	МассивСтроки = ОбщегоНазначенияСУКлиентСервер.РасщепитьСтроку(Строка, ",");
	
	ФинальнаяСтрока = "";
	
	НомерЭлемента = 1;
	КоличествоЭлементов = МассивСтроки.Количество();
	Для каждого Элемент Из МассивСтроки Цикл
	
		ФинальнаяСтрока = ФинальнаяСтрока + Элемент;
		
		Если НомерЭлемента <> КоличествоЭлементов Тогда
			Если НомерЭлемента = (КоличествоЭлементов - 1) Тогда
				ФинальнаяСтрока = ФинальнаяСтрока + " и ";
			Иначе
				ФинальнаяСтрока = ФинальнаяСтрока + ", ";	
			КонецЕсли;
		КонецЕсли;
		
		НомерЭлемента = НомерЭлемента + 1;
		
	КонецЦикла;	
	
	Возврат ФинальнаяСтрока;
	
КонецФункции

// Получает количество секунд из структуры,
// в которой указаны параметры временного интервала
//
Функция ПолучитьКоличествоСекундИзСтруктурыВременногоИнтервала(Знач СтруктураИнтервала) Экспорт
	
	СуммаСекунд = СтруктураИнтервала.КоличествоСекунд +
	(СтруктураИнтервала.КоличествоМинут*60) +
	(СтруктураИнтервала.КоличествоЧасов*60*60) +
	(СтруктураИнтервала.КоличествоДней*60*60*24) +
	(СтруктураИнтервала.КоличествоМесяцев*60*60*24*(365/12)) +
	(СтруктураИнтервала.КоличествоЛет*60*60*24*365);
	
	СуммаСекунд = Окр(СуммаСекунд);
	
	Возврат СуммаСекунд;
	
КонецФункции
